Repository: giellalt/corpus-fin
Catalog: tmx/smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=486_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: Aloitin syksyllä 2010 luokanopettajanopinnot Kautokeinossa Sámi Allaskuvlassa (saamelaisessa korkeakoulussa).
smn: Algâttim čohčuv 2010 luokamáttáátteijeeoopâid Kuovdâkiäinust Säämi Ollâškoovlâst.

source: Olin aivan varma, etten ole tarpeeksi saamelainen Allaskuvlaan.
smn: Lijjim aaibâs vises, et jiem lah tuárvi sämmilâš Ollâškoovlân.

source: Kasvoin Utsjoella täysi-ikäiseksi asti.
smn: Šoddim Ucjuuvâst olesave räi.

source: Lapsena kuljin isän mukana niin porohommissa kuin saamelaiskäräjien kokouksissakin.
smn: Párnážin juuttim eeji fáárust nuuvt puásuipargoin ko sämitige čuákkimijn-uv.

source: Jostain syystä en kuitenkaan ikinä puhunut saamea isälleni, enkä oikeastaan muillekaan.
smn: Monnii suujâst jiem kuittâg kuássin sárnum iäčán sämikielâ, jiemge riävtui iärásáidgin.

source: Lopetin yläasteella kulkemasta erotusaidallakin.
smn: Pajetääsist lopâttim jotemist pygálusääiđist-uv.

source: Kun muutin Ouluun, en puhunut kokonaiseen vuoteen kenellekään saamea.
smn: Ko värrejim Oulun, te jiem sárnum oles ihán kiässán sämikielâ.

source: Utsjoelle takaisin tultaessa työ saamenkielisessä päiväkodissa elvytti kuitenkin nopeasti saamen kieleni.
smn: Ko poottim Ucjuuhân maassâd, te pargo sämikielâlii peivikiäjust iäláskitij kuittâg jotelávt sämikielâ.

source: Myöhemmin palailin hiljalleen myös poronhoitoon.
smn: Maŋeláá macâdim kuuloold meid puásuituálun.

source: Allaskuvlassa kuitenkin huomasin, että minuthan on ” kasvatettu ” saamelaiseksi ja saamelaisella tavalla, huomaamattani.
smn: Ollâškoovlâst kuittâg huámášim, et munhân lam “ šoddâdum ” sämmilâžžân já säämi vuovvijn, muu huámmášhánnáá.

source: Tiedän sen nyt, että olen saamelainen. Ja siksi luenkin opettajaksi, jotta voin siirtää kieltä mahdollisimman monelle.
smn: Tiäđám tom tääl, et lam sämmilâš já tondiet luuvâm-uv máttáátteijen, vâi puávtám sirdeđ kielâ nuuvt maŋgâsân ko máhđulâš.
